
<?php 
/*
Template Name: Станция бренда (шаблон)
Template Post Type: post
*/

get_header(); ?>

<?php get_template_part('template-parts/banner-brand');?>

<section class="all_page_content_section pad_50 text_blk">
    <div class="_container">
    <p>
        <a href="#">Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты.</a> Вдали от всех живут они в буквенных домах на берегу Семантика большого языкового океана. Маленький ручеек Даль журчит по всей стране и обеспечивает ее всеми необходимыми правилами. 
    </p>

    <h2>Пример заголовка h2</h2>
    
    <p>
        <strong>Эта парадигматическая страна</strong>, в которой жаренные члены предложения залетают прямо в рот. Даже всемогущая пунктуация не имеет власти над рыбными текстами, ведущими безорфографичный образ жизни. Однажды одна маленькая строчка рыбного текста по имени Lorem ipsum решила выйти в большой мир грамматики. Великий Оксмокс предупреждал ее о злых запятых, диких знаках вопроса и коварных точках с запятой, но текст не дал сбить себя с толку. 
    </p>
    
    <p>
        Он собрал семь своих заглавных букв, подпоясал инициал за пояс и пустился в дорогу. Взобравшись на первую вершину курсивных гор, 
        бросил он последний взгляд назад, на силуэт своего родного города Буквоград, на заголовок деревни Алфавит и на подзаголовок своего переулка Строчка. 
    </p>

    <h3>Пример заголовк h3</h3>
    
    <ul>
        <li>Пункт #1</li>
        <li>Пункт #2</li>
        <li>Пункт #3</li>
        <li>Пункт #4</li>
    </ul>

    <p>
        Грустный риторический вопрос скатился по его щеке и он продолжил свой путь. По дороге встретил текст рукопись. Она предупредила его: «В моей стране все переписывается по несколько раз. Единственное, что от меня осталось, это приставка «и». 
    </p>
    
    <p>
    Возвращайся ты лучше в свою безопасную страну». Не послушавшись рукописи, наш текст продолжил свой путь. Вскоре ему повстречался коварный составитель
    </p>
    </div>
</section>

<?php get_footer(); ?>