<?php

global $wpdb;

$all_price_table = $wpdb->get_results("SELECT * FROM `all_prices`");

if	(empty($all_price_table)) {
	$all_field = [
		[
			"category" => "Ремонт компютеров",
			"polomka" => "",
			"brand" => "",
			"name" => "Поломка компютера #1",
			"price" => rand(500, 3500),
		],
		[
			"category" => "Ремонт компютеров",
			"polomka" => "",
			"brand" => "",
			"name" => "Поломка компютера #2",
			"price" => rand(500, 3500),
		],
		[
			"category" => "Ремонт компютеров",
			"polomka" => "",
			"brand" => "",
			"name" => "Поломка компютера #3",
			"price" => rand(500, 3500),
		],
		[
			"category" => "Ремонт компютеров",
			"polomka" => "",
			"brand" => "",
			"name" => "Поломка компютера #4",
			"price" => rand(500, 3500),
		],
		
		[
			"category" => "Ремонт ноутбуков",
			"polomka" => "",
			"brand" => "",
			"name" => "Поломка ноутбука #1",
			"price" => rand(500, 3500),
		],
		[
			"category" => "Ремонт ноутбуков",
			"polomka" => "",
			"brand" => "",
			"name" => "Поломка ноутбука #2",
			"price" => rand(500, 3500),
		],
		[
			"category" => "Ремонт ноутбуков",
			"polomka" => "",
			"brand" => "",
			"name" => "Поломка ноутбука #3",
			"price" => rand(500, 3500),
		],
		[
			"category" => "Ремонт ноутбуков",
			"polomka" => "",
			"brand" => "",
			"name" => "Поломка ноутбука #4",
			"price" => rand(500, 3500),
		],

		[
			"category" => "Ремонт посудомоек",
			"polomka" => "",
			"brand" => "",
			"name" => "Поломка посудомоек #1",
			"price" => rand(500, 3500),
		],
		[
			"category" => "Ремонт посудомоек",
			"polomka" => "",
			"brand" => "",
			"name" => "Поломка посудомоек #2",
			"price" => rand(500, 3500),
		],
		[
			"category" => "Ремонт посудомоек",
			"polomka" => "",
			"brand" => "",
			"name" => "Поломка посудомоек #3",
			"price" => rand(500, 3500),
		],
		[
			"category" => "Ремонт посудомоек",
			"polomka" => "",
			"brand" => "",
			"name" => "Поломка посудомоек #4",
			"price" => rand(500, 3500),
		],
	];

	$wpdb->show_errors(); // включит показ ошибок
	// var_dump($all_field);

	foreach ($all_field as $item)
		$wpdb->insert("all_prices", $item);

	
	$wpdb->hide_errors(); // выключит показ ошибок
	$wpdb->print_error(); // включит показ ошибок на экран
}

$all_masters = $wpdb->get_results("SELECT * FROM `all_masters`");

if	(empty($all_masters)) {
	$all_field = [
        ["name" => "Иван", "adress" => "ул. Новый Арбат, дом 15, Москва", "geo" => "55.751977, 37.587207", "city"=>"Москва"],
        ["name" => "Степан", "adress" => "ул. Тверская, дом 7, Москва", "geo" => "55.764390, 37.605100", "city"=>"Москва"],
        ["name" => "Рамзан", "adress" => "ул. Пятницкая, дом 54, Москва", "geo" => "55.731156, 37.625596", "city"=>"Москва"],
        ["name" => "Никадим", "adress" => "ул. Большая Ордынка, дом 48, Москва", "geo" => "55.734589, 37.623200", "city"=>"Москва"],
        ["name" => "Аристарх", "adress" => "ул. Малая Бронная, дом 13, Москва", "geo" => "55.769930, 37.590943", "city"=>"Москва"],
        ["name" => "Трой", "adress" => "ул. Полковая, дом 3, Москва", "geo" => "55.863155, 37.429474", "city"=>"Москва"],

        ["name" => "Карл", "adress" => "ул. Октябрьская, дом 10, Подольск", "geo" => "55.426937, 37.549863", "city"=>"Подольск"],
        ["name" => "Махмуд", "adress" => "ул. Ленина, дом 5, Подольск", "geo" => "55.426633, 37.542010", "city"=>"Подольск"],
        ["name" => "Аслан", "adress" => "ул. Гоголя, дом 8, Подольск", "geo" => "55.430676, 37.542024", "city"=>"Подольск"],
        ["name" => "Крис", "adress" => "ул. Мира, дом 21, Подольск", "geo" => "55.425191, 37.542952", "city"=>"Подольск"],
        ["name" => "Райен", "adress" => "ул. Кирова, дом 23, Подольск", "geo" => "55.424564, 37.542979", "city"=>"Подольск"],
        ["name" => "Петр", "adress" => "ул. Комсомольская, дом 11, Подольск", "geo" => "55.437729, 37.542247", "city"=>"Подольск"]
        
    ];

    $wpdb->show_errors(); // включит показ ошибок
	// var_dump($all_field);

	foreach ($all_field as $item)
		$wpdb->insert("all_masters", $item);

	
	$wpdb->hide_errors(); // выключит показ ошибок
	$wpdb->print_error(); // включит показ ошибок на экран
}
